README.org
#+TITLE: Literate dotfiles
#+AUTHOR: Eric Lim
#+auto_tangle: t

I use [[https://www.gnu.org/software/stow][stow ]]to manage my configuration files. Here's how it's run:
#+begin_src sh :tangle no
stow -Rv $(ls -d */ | tr "/\n" " ") --target=$HOME
#+end_src

* Table of Contents :TOC:
- [[#alacritty][Alacritty]]
- [[#amethyst][Amethyst]]
- [[#doom-emacs][Doom Emacs]]
  - [[#packages][packages]]
  - [[#init][init]]
  - [[#config][config]]
- [[#git][Git]]
- [[#neovim][Neovim]]
  - [[#plugins][plugins]]
  - [[#lsp][lsp]]
- [[#python][Python]]
- [[#starship][Starship]]
- [[#zsh][Zsh]]

* Alacritty
[[file:alacritty/.config/alacritty/alacritty.toml]]
#+begin_src toml :tangle ./alacritty/.config/alacritty/alacritty.toml
live_config_reload = true

[colors]
draw_bold_text_with_bright_colors = true

[colors.bright]
black = "#5c6370"
blue = "#61afef"
cyan = "#56b6c2"
green = "#98c379"
magenta = "#c678dd"
red = "#e06c75"
white = "#ffffff"
yellow = "#d19a66"

[colors.normal]
black = "#1e2127"
blue = "#61afef"
cyan = "#56b6c2"
green = "#98c379"
magenta = "#c678dd"
red = "#e06c75"
white = "#abb2bf"
yellow = "#d19a66"

[colors.primary]
background = "#282c34"
foreground = "#abb2bf"

[cursor.style]
blinking = "On"
shape = "Underline"

[cursor.vi_mode_style]
shape = "Block"

[font]
size = 14

[font.bold]
family = "Hack Nerd Font"
style = "Bold"

[font.bold_italic]
family = "Hack Nerd Font"
style = "Bold Italic"

[font.italic]
family = "Hack Nerd Font"
style = "Italic"

[font.normal]
family = "Hack Nerd Font"
style = "Regular"

[[keyboard.bindings]]
chars = "\u001Bb"
key = "Left"
mods = "Alt"

[[keyboard.bindings]]
chars = "\u001Bf"
key = "Right"
mods = "Alt"

[[keyboard.bindings]]
action = "ToggleViMode"
key = "Escape"
mode = "~Search"
mods = "Super"

[[keyboard.bindings]]
action = "SearchForward"
key = "F"
mode = "~Search"
mods = "Control|Shift"

[[keyboard.bindings]]
action = "SearchBackward"
key = "F"
mode = "~Search"
mods = "Control"

[scrolling]
history = 10000
multiplier = 10

[selection]
save_to_clipboard = true

[window]
decorations = "buttonless"
opacity = 0.7

[window.padding]
x = 5
y = 5
#+end_src

* Amethyst
[[file:amethyst/.config/amethyst/amethyst.yml]]
#+begin_src yaml :tangle ./amethyst/.config/amethyst/amethyst.yml
layouts:
    - two-pane
    - 3column-left
    - widescreen-tall
    - column
    - tall
    - wide
    - middle-wide

mod1:
    - shift
    - command
mod2:
    - shift
    - control
    - command

relaunch-amethyst:
    mod: mod2
    key: x

focus-main:
  mod: mod2
  key: m

focus-screen-ccw:
  mod: mod2
  key: p
focus-screen-cw:
  mod: mod2
  key: n

select-tall-layout:
  mod: mod2
  key: a
select-wide-layout:
  mod: mod2
  key: s
select-fullscreen-layout:
  mod: mod2
  key: d
select-column-layout:
  mod: mod2
  key: f

reevaluate-windows:
  mod: mod2
  key: z

toggle-focus-follows-mouse:
  mod: mod1
  key: x

relaunch-amethyst:
  mod: mod2
  key: x

focus-follows-mouse: false

window-margins: true
window-margin-size: 8
#+end_src

* Doom Emacs
** packages
[[file:doom/.config/doom/packages.el]]
#+begin_src emacs-lisp :tangle ./doom/.config/doom/packages.el
(package! nov)
(package! org-auto-tangle)
(package! org-superstar)
#+end_src

** init
#+begin_src emacs-lisp :tangle ./doom/.config/doom/init.el
(doom! :input
       ;;bidi              ; (tfel ot) thgir etirw uoy gnipleh
       ;;chinese
       ;;japanese
       ;;layout            ; auie,ctsrnm is the superior home row

       :completion
       company           ; the ultimate code completion backend
       ;;helm              ; the *other* search engine for love and life
       ;;ido               ; the other *other* search engine...
       ;;ivy               ; a search engine for love and life
       vertico           ; the search engine of the future

       :ui
       ;;deft              ; notational velocity for Emacs
       doom              ; what makes DOOM look the way it does
       doom-dashboard    ; a nifty splash screen for Emacs
       ;;doom-quit         ; DOOM quit-message prompts when you quit Emacs
       ;;(emoji +unicode)  ; 🙂
       hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
       ;;hydra
       ;;indent-guides     ; highlighted indent columns
       ;;ligatures         ; ligatures and symbols to make your code pretty again
       ;;minimap           ; show a map of the code on the side
       modeline          ; snazzy, Atom-inspired modeline, plus API
       ;;nav-flash         ; blink cursor line after big motions
       ;;neotree           ; a project drawer, like NERDTree for vim
       ophints           ; highlight the region an operation acts on
       (popup +defaults)   ; tame sudden yet inevitable temporary windows
       ;;tabs              ; a tab bar for Emacs
       treemacs          ; a project drawer, like neotree but cooler
       ;;unicode           ; extended unicode support for various languages
       (vc-gutter +pretty) ; vcs diff in the fringe
       vi-tilde-fringe   ; fringe tildes to mark beyond EOB
       ;;window-select     ; visually switch windows
       workspaces        ; tab emulation, persistence & separate workspaces
       ;;zen               ; distraction-free coding or writing

       :editor
       (evil +everywhere); come to the dark side, we have cookies
       file-templates    ; auto-snippets for empty files
       fold              ; (nigh) universal code folding
       (format +onsave)  ; automated prettiness
       ;;god               ; run Emacs commands without modifier keys
       ;;lispy             ; vim for lisp, for people who don't like vim
       ;;multiple-cursors  ; editing in many places at once
       ;;objed             ; text object editing for the innocent
       ;;parinfer          ; turn lisp into python, sort of
       ;;rotate-text       ; cycle region at point between text candidates
       snippets          ; my elves. They type so I don't have to
       ;;word-wrap         ; soft wrapping with language-aware indent

       :emacs
       dired             ; making dired pretty [functional]
       electric          ; smarter, keyword-based electric-indent
       ibuffer           ; interactive buffer management
       undo              ; persistent, smarter undo for your inevitable mistakes
       vc                ; version-control and Emacs, sitting in a tree

       :term
       eshell            ; the elisp shell that works everywhere
       ;;shell             ; simple shell REPL for Emacs
       ;;term              ; basic terminal emulator for Emacs
       vterm             ; the best terminal emulation in Emacs

       :checkers
       syntax              ; tasing you for every semicolon you forget
       (spell +flyspell) ; tasing you for misspelling mispelling
       ;;grammar           ; tasing grammar mistake every you make

       :tools
       ;;ansible
       ;;biblio            ; Writes a PhD for you (citation needed)
       ;;collab            ; buffers with friends
       ;;debugger          ; FIXME stepping through code, to help you add bugs
       ;;direnv
       ;;docker
       editorconfig      ; let someone else argue about tabs vs spaces
       ;;ein               ; tame Jupyter notebooks with emacs
       (eval +overlay)     ; run code, run (also, repls)
       ;;gist              ; interacting with github gists
       lookup              ; navigate your code and its documentation
       lsp               ; M-x vscode
       magit             ; a git porcelain for Emacs
       ;;make              ; run make tasks from Emacs
       ;;pass              ; password manager for nerds
       ;;pdf               ; pdf enhancements
       ;;prodigy           ; FIXME managing external services & code builders
       ;;rgb               ; creating color strings
       ;;taskrunner        ; taskrunner for all your projects
       ;;terraform         ; infrastructure as code
       ;;tmux              ; an API for interacting with tmux
       tree-sitter       ; syntax and parsing, sitting in a tree...
       ;;upload            ; map local to remote projects via ssh/ftp

       :os
       (:if IS-MAC macos)  ; improve compatibility with macOS
       ;;tty               ; improve the terminal Emacs experience

       :lang
       ;;agda              ; types of types of types of types...
       ;;beancount         ; mind the GAAP
       ;;(cc +lsp)         ; C > C++ == 1
       ;;clojure           ; java with a lisp
       ;;common-lisp       ; if you've seen one lisp, you've seen them all
       ;;coq               ; proofs-as-programs
       ;;crystal           ; ruby at the speed of c
       ;;csharp            ; unity, .NET, and mono shenanigans
       ;;data              ; config/data formats
       ;;(dart +flutter)   ; paint ui and not much else
       ;;dhall
       ;;elixir            ; erlang done right
       ;;elm               ; care for a cup of TEA?
       emacs-lisp        ; drown in parentheses
       ;;erlang            ; an elegant language for a more civilized age
       ;;ess               ; emacs speaks statistics
       ;;factor
       ;;faust             ; dsp, but you get to keep your soul
       ;;fortran           ; in FORTRAN, GOD is REAL (unless declared INTEGER)
       ;;fsharp            ; ML stands for Microsoft's Language
       ;;fstar             ; (dependent) types and (monadic) effects and Z3
       ;;gdscript          ; the language you waited for
       (go +lsp)         ; the hipster dialect
       ;;(graphql +lsp)    ; Give queries a REST
       ;;(haskell +lsp)    ; a language that's lazier than I am
       ;;hy                ; readability of scheme w/ speed of python
       ;;idris             ; a language you can depend on
       json              ; At least it ain't XML
       ;;(java +lsp)       ; the poster child for carpal tunnel syndrome
       javascript        ; all(hope(abandon(ye(who(enter(here))))))
       ;;julia             ; a better, faster MATLAB
       ;;kotlin            ; a better, slicker Java(Script)
       ;;latex             ; writing papers in Emacs has never been so fun
       ;;lean              ; for folks with too much to prove
       ;;ledger            ; be audit you can be
       lua               ; one-based indices? one-based indices
       markdown          ; writing docs for people to ignore
       ;;nim               ; python + lisp at the speed of c
       ;;nix               ; I hereby declare "nix geht mehr!"
       ;;ocaml             ; an objective camel
       org               ; organize your plain life in plain text
       ;;php               ; perl's insecure younger brother
       ;;plantuml          ; diagrams for confusing people more
       ;;purescript        ; javascript, but functional
       python            ; beautiful is better than ugly
       ;;qt                ; the 'cutest' gui framework ever
       ;;racket            ; a DSL for DSLs
       ;;raku              ; the artist formerly known as perl6
       ;;rest              ; Emacs as a REST client
       ;;rst               ; ReST in peace
       ;;(ruby +rails)     ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
       ;;(rust +lsp)       ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
       ;;scala             ; java, but good
       ;;(scheme +guile)   ; a fully conniving family of lisps
       sh                ; she sells {ba,z,fi}sh shells on the C xor
       ;;sml
       ;;solidity          ; do you need a blockchain? No.
       ;;swift             ; who asked for emoji variables?
       ;;terra             ; Earth and Moon in alignment for performance.
       web               ; the tubes
       yaml              ; JSON, but readable
       ;;zig               ; C, but simpler

       :email
       ;;(mu4e +org +gmail)
       ;;notmuch
       ;;(wanderlust +gmail)

       :app
       ;;calendar
       ;;emms
       ;;everywhere        ; *leave* Emacs!? You must be joking
       ;;irc               ; how neckbeards socialize
       (rss +org)        ; emacs as an RSS reader
       ;;twitter           ; twitter client https://twitter.com/vnought

       :config
       ;;literate
       (default +bindings +smartparens))
#+end_src

** config
[[file:doom/.config/doom/config.el]]
*** ui
#+begin_src emacs-lisp :tangle ./doom/.config/doom/config.el
(setq doom-theme 'doom-one)

(setq doom-font
      (font-spec
       :family "Roboto Mono"
       :size 14
       :weight 'normal))
(setq doom-variable-pitch-font
      (font-spec
       :family "Georgia"
       :size 20))

(setq display-line-numbers-type 'relative)

(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-footer)
#+end_src

*** org
#+begin_src emacs-lisp :tangle ./doom/.config/doom/config.el
(setq org-directory "~/github.com/cowboy-bebug/org")
(after! org
  (setq org-edit-src-content-indentation nil)
  (setq org-hide-emphasis-markers t)
  (use-package! org-superstar
    :hook
    (org-mode . org-superstar-mode))
  (use-package! org-auto-tangle
    :defer t
    :config
    (setq org-auto-tangle-babel-safelist '("~/github.com/cowboy-bebug/dotfiles/README.org"))
    :hook
    (org-mode . org-auto-tangle-mode)))
#+end_src

*** git
#+begin_src emacs-lisp :tangle ./doom/.config/doom/config.el
(after! magit
  :config
  (setq magit-log-section-commit-count 30))
#+end_src

*** file association
#+begin_src emacs-lisp :tangle ./doom/.config/doom/config.el
(setq auto-mode-alist
      (append '(("\\.mdx\\'" . markdown-mode))
              auto-mode-alist))
#+end_src

*** project
#+begin_src emacs-lisp :tangle ./doom/.config/doom/config.el
(after! projectile
  :config
  (setq projectile-track-known-projects-automatically nil))
#+end_src

*** spell checking
#+begin_src emacs-lisp :tangle ./doom/.config/doom/config.el
(after! flyspell
  :config
  (let ((aspell-personal-directory
         (string-trim-right
          (shell-command-to-string "aspell config home-dir"))))
    (setq ispell-personal-dictionary
          (expand-file-name ".aspell.en.pws"  aspell-personal-directory))))
#+end_src

*** reading
**** epub
#+begin_src emacs-lisp :tangle ./doom/.config/doom/config.el
(use-package! nov
  :mode
  ("\\.epub\\'" . nov-mode)

  :hook
  (add-hook 'nov-mode-hook
            (function lambda()
                      (face-remap-add-relative
                       'variable-pitch
                       :family "Georgia"
                       :height 1.0))))
#+end_src

