doom/.config/doom/config.el
  (setq elfeed-search-filter "@1-month-ago +unread")
  (setq elfeed-feeds
        '(("https://feeds.feedburner.com/TheDailyWtf" programming)
          ("https://lobste.rs/rss" programming)
          ("https://www.news.ycombinator.com/rss" programming)
          ("https://www.reddit.com/r/programming/.rss" programming)
          ("https://techcrunch.com/feed" new tech)))
  (setq browse-url-browser-function 'eww-browse-url)
  (set-popup-rules!
    '(("^\\*eww\\*"
       :side right
       :slot 1
       :size #'+popup-shrink-to-fit
       :select t))))
